Revit 2027 API
IFCExportOptions Constructor
 Default constructor. Initializes FileVersion to Default. WallAndColumnSplitting and ExportBaseQuantities are set to false. FamilyMappingFile is set to empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCExportOptions()
Public Sub New
public:
IFCExportOptions()
new : unit -> IFCExportOptions
See Also
Reference
IFCExportOptions Class
IFCExportOptions Overload
Autodesk.Revit.DB Namespace